OpenFoam/design_points/design_point_2/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-9.67009
-9.42302
-9.17595
-8.92887
-8.68178
-8.43468
-8.18759
-7.94048
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-5.19788
-5.18347
-5.16854
-5.15313
-5.13724
-5.12092
-5.10419
-5.08706
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-9.72641
-9.47641
-9.22641
-8.97641
-8.72641
-8.47641
-8.22641
-7.97641
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.023592
-0.226408
-0.476408
-0.726408
-0.976409
-1.22641
-1.47641
-1.72641
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform -15;
    }
    Outlet
    {
        type            calculated;
        value           uniform 15;
    }
}


// ************************************************************************* //
